from random import randint
lst = [randint(1, 10) for i in range(15)]#список рандомных чисел в диапазоне от 1 до 10. Длина списка - 15 элементов
print(lst)
lst.append("строка")#Добавить новый элемент типа str в конец списка
print(lst)
lst[4]=223# Добавить новый элемент типа int на место с индексом 4
print(lst)
lst.extend([2,23,4])#Добавить новый элемент типа list в конец списка
print(lst)
print(lst[5])#Получить элемент по индексу 5
c = lst[5]#переменная равна элементу под индексом 5
del lst[5]#удаление элемента по индексу
print(lst) 
lst.insert(5,c)#возврат удаленного элемента в список на свое место
print(lst)
lst.remove(c)#удаление элемента по его значению
print(lst)

