a = int(input('введите первое число:'))
b = int(input('введите второе число:'))
print(f'{a} + {b} = {a+b}')#сумма чисел a и b
print(f'{a} - {b} = {a-b}')#разность чисел a и b
print(f'{a} * {b} = {a*b}')#произведение чисел a и b
print(f'{a} / {b} = {a/b}')#частное чисел a и b
print(f'{a} // {b} = {a//b}')#целая часть от деления числа a на b
print(f'{a} % {b} = {a%b}')#остаток от деления числа a на b
print(f'({a}**10  + {b}**10)**0.5 = {(a**10+b**10)**0.5}')#корень квадратный следующего выражения a^10+b^10

  


  



