lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]
print(lst)
l = []
c = []
ostatok = ''
for i in lst:
  if i<30 and i%3==0:
    l.append(i)
    lst.remove(i)
    c = lst
print(l)#вывести элементы, которые одновременно 1) меньше 30 и 2) делятся на 3 без остатка.
print(c)#список из остальных элементов списка
sumElements = sum(c)#сумма оставшихся элементов
print(f'сумма элементов остатка равна {sumElements}')
l.extend([sumElements])# добавление суммы в список 
print(l)#список из элементов которые одновременно меньше 30 и делятся на 3 без остатка и элемент суммы оставшихся элементов 