str1 = 'пишите код так, как будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете.'

stroka = str1.capitalize()#Начните строку с заглавной буквы.
print(stroka)

index = str1.find("сопровождать")#Найдите индекс вхождения подстроки ‘сопровождать’.
print(index)  

zamena = stroka.replace('сопровождать','поддерживать')#Замените вхождение подстроки ‘сопровождать’ на ‘поддерживать'.
print(zamena)

razdelenie = stroka.split(',')#Разбейте предложение на части по запятым.
print(razdelenie)

soedinenie = ','.join(razdelenie)#Соедините части обратно, снова добавив запятые между частями.
print(soedinenie)

   
   

  